ntflix/ESPNowMidiBridge/sdkconfig.defaults
# ESP-IDF Configuration Defaults for ESPNOWMIDIBridge

# Target device
CONFIG_IDF_TARGET="esp32c6"

# WiFi Configuration
CONFIG_ESP_WIFI_SSID=""
CONFIG_ESP_WIFI_PASSWORD=""
CONFIG_ESP_WIFI_MODE_STA=y

# ESP-NOW Configuration
CONFIG_ESP_NOW_ENABLE=y

# FreeRTOS Configuration
CONFIG_FREERTOS_USE_IDLE_HOOK=n
CONFIG_FREERTOS_USE_TICK_HOOK=n
CONFIG_FREERTOS_TICK_RATE_HZ=100

# USB Serial/JTAG Configuration
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_BAUDRATE=115200

# Logging Configuration
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# NVS Flash Configuration
CONFIG_NVS_ENCRYPTION=n

# Memory Configuration
CONFIG_ESP32C6_DEBUG_OCDAWARE=y

# Compiler Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Minimal build
CONFIG_MINIMAL_BUILD=y

CONFIG_LD_ORPHAN_PLACE=y
